[[{"topic":3,"date":"","votes":15,"actions":[{"title":"Sign Petition","description":"Go to <website> and sign the petition to investigate the injustice system!"},{"title":"Local Mayor","description":"Talk to your mayor and ask what he can do to ensure equal treatment in your home town."}]}],[{"name":"Sexual Assault","description":"Sexual assault is a sexual act in which a person is coerced or physically forced to engage against their will, or non-consensual sexual touching of a person.","tips":["Discuss whether it is good to encourage victims to talk about their feelings.","Many people find this topic hard to discuss. Practice some patience with this one.","Tie this topic in with other social injustices."]},{"name":"Death Penalty","description":"The Death Penalty is a government sanctioned practice whereby a person is put to death by the state as a punishment for a crime.","tips":["Research the history of death penalty legislation.","Is the death penalty more inhumane than a life sentence?","What kind of costs does our society accrue due to the death penalty?"]},{"name":"Environmental Rights","description":"Environmentalism or environmental rights is a broad philosophy, ideology, and social movement regarding concerns for environmental protection and improvement of the health of the environment, particularly as the measure for this health seeks to incorporate the impact of changes to the environment on humans, animals, plants and non-living matter.","tips":["Does polution hurt industry?","Discuss the effectiveness of protesting."]},{"name":"Justice System Racism","description":"Justice System Racism refers to the unique experiences and disparities in the United States in regard to the policing and prosecuting of various races. ","tips":["What role does wealth play?","Discuss the typical vs familiar view on this topic.","How should we try to change our justice system?"]},{"name":"Workplace Sexual Harassment","description":"Workplace Sexual Harassment is bullying or coercion of a sexual nature, or the unwelcome or inappropriate promise of rewards in exchange for sexual favors in the context of a professional or impersonal setting.","tips":["How common is it and why wouldn't it be reported frequently?","Does company culture contribute to this problem?","Give scenarios and include all genders and races."]}],[{"topic":0,"votes":10},{"topic":1,"votes":5},{"topic":2,"votes":3},{"topic":3,"votes":2},{"topic":4,"votes":2}],[{}]]